SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ, Н_ВЕДОМОСТИ.ИД FROM
    Н_ТИПЫ_ВЕДОМОСТЕЙ RIGHT JOIN Н_ВЕДОМОСТИ ON
    Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ТВ_ИД
    WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Ведомость' AND
        Н_ВЕДОМОСТИ.ИД < 1250972 AND
        Н_ВЕДОМОСТИ.ИД = 1490007;


SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.УЧГОД FROM
    Н_ЛЮДИ LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
            LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД WHERE
        Н_ЛЮДИ.ОТЧЕСТВО > 'Владимирович' AND
        Н_ВЕДОМОСТИ.ЧЛВК_ИД > 117219;


WITH TMP_TABLE AS (
SELECT COUNT(*) FROM Н_ЛЮДИ GROUP BY Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ
    )
SELECT COUNT(*) FROM TMP_TABLE;


WITH TAB AS (
    SELECT COUNT(DISTINCT Н_УЧЕНИКИ.ЧЛВК_ИД), Н_УЧЕНИКИ.ГРУППА
    FROM Н_УЧЕНИКИ
             JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
             JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД_ЗАКРЕПЛЕН_ЗА = Н_ОТДЕЛЫ.ИД
    WHERE Н_ПЛАНЫ.УЧЕБНЫЙ_ГОД = '2011/2012'
      AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'ВТ'
    GROUP BY Н_УЧЕНИКИ.ГРУППА
)
SELECT ГРУППА FROM TAB WHERE COUNT = 5;

WITH TAB AS (
    SELECT AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INT)) AS AV, Н_УЧЕНИКИ.ЧЛВК_ИД
    FROM Н_ВЕДОМОСТИ
             JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_УЧЕНИКИ.ГРУППА = '4100'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'зачет'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'незач'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'неявка'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'осв'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != '99'
    GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
)
SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО, AV AS СРЕДНЯЯ_ОЦЕНКА FROM TAB JOIN Н_ЛЮДИ ON TAB.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE TAB.AV >= (SELECT MIN(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INT))
                 FROM Н_ВЕДОМОСТИ
                          JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
                 WHERE Н_УЧЕНИКИ.ГРУППА = '3100'
                   AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'зачет'
                   AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'незач'
                   AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'неявка'
                   AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'осв'
                   AND Н_ВЕДОМОСТИ.ОЦЕНКА != '99');




SELECT Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО FROM Н_УЧЕНИКИ
    JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД
    JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE КОНЕЦ = '2012-09-01 00:00:00.000000'
AND EXISTS(SELECT * FROM Н_НАПР_СПЕЦ WHERE
    Н_НАПР_СПЕЦ.НАИМЕНОВАНИЕ = 'Программная инженерия'
    AND Н_НАПР_СПЕЦ.ИД = Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД);



WITH TAB AS (
    SELECT AVG(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INT)) AS AV, MIN(CAST(Н_ВЕДОМОСТИ.ОЦЕНКА AS INT)) AS MN, Н_УЧЕНИКИ.ЧЛВК_ИД
    FROM Н_ВЕДОМОСТИ
             JOIN Н_УЧЕНИКИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
             JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
             JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД_ЗАКРЕПЛЕН_ЗА = Н_ОТДЕЛЫ.ИД
    WHERE Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'зачет'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'незач'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'неявка'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != 'осв'
      AND Н_ВЕДОМОСТИ.ОЦЕНКА != '99'
    GROUP BY Н_УЧЕНИКИ.ЧЛВК_ИД
)
SELECT COUNT(DISTINCT TAB.ЧЛВК_ИД) FROM TAB WHERE AV != 5 AND MN > 3;


SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД FROM
Н_ТИПЫ_ВЕДОМОСТЕЙ INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ТВ_ИД = Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Ведомость'
AND Н_ВЕДОМОСТИ.ИД > 1250972;

CREATE INDEX ON Н_ВЕДОМОСТИ USING BTREE(ИД);
CREATE INDEX ON Н_ВЕДОМОСТИ USING HASH(ТВ_ИД);
CREATE INDEX ON Н_ТИПЫ_ВЕДОМОСТЕЙ USING HASH(НАИМЕНОВАНИЕ);
CREATE INDEX ON Н_ТИПЫ_ВЕДОМОСТЕЙ USING HASH(ИД);

EXPLAIN ANALYZE SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ИД FROM
    Н_ТИПЫ_ВЕДОМОСТЕЙ INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ТВ_ИД = Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
                WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Ведомость'
                  AND Н_ВЕДОМОСТИ.ИД > 1250972;

EXPLAIN ANALYZE SELECT Н_ЛЮДИ.ОТЧЕСТВО, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.НАЧАЛО FROM
Н_ЛЮДИ LEFT JOIN Н_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
LEFT JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ИМЯ > 'Александр'
AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД > 163484
AND Н_УЧЕНИКИ.ИД = 100410;

CREATE INDEX ON Н_ЛЮДИ USING BTREE(ИМЯ);
CREATE INDEX ON Н_ОБУЧЕНИЯ USING BTREE(ЧЛВК_ИД);
CREATE INDEX ON Н_ЛЮДИ USING HASH(ИД);
CREATE INDEX ON Н_ОБУЧЕНИЯ USING HASH(ЧЛВК_ИД);
CREATE INDEX ON Н_УЧЕНИКИ USING HASH(ИД);

